MOCK_TEST_1 = {
    "id": 1,
    "name": "Тест о наличии НДО",
    "questions": [
        {
            "id": 100,
            "text": "Вы ощущали нехватку еды или были вынуждены носить грязную одежду?",
            "answers": [
                {"id": 1001, "text": "Да", "value": 1},
                {"id": 1002, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 101,
            "text": "Вы потеряли родителя вследствие развода, смерти или по другой причине?",
            "answers": [
                {"id": 1011, "text": "Да", "value": 1},
                {"id": 1012, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 102,
            "text": "Вы проживали с кем-то, кто был в депрессии или психически болен",
            "answers": [
                {"id": 1021, "text": "Да", "value": 1},
                {"id": 1022, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 103,
            "text": "Вы проживали с кем-то, у кого были проблемы с выпивкой или наркотиками?",
            "answers": [
                {"id": 1031, "text": "Да", "value": 1},
                {"id": 1032, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 104,
            "text": "Ваши родители когда-либо избивали или угрожали причинить вред друг другу?",
            "answers": [
                {"id": 1041, "text": "Да", "value": 1},
                {"id": 1042, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 105,
            "text": "Вы проживали с кем-то, кто попал в тюрьму?",
            "answers": [
                {"id": 1051, "text": "Да", "value": 1},
                {"id": 1052, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 106,
            "text": "Родитель когда-либо обзывал, оскорблял или подавлял вас?",
            "answers": [
                {"id": 1061, "text": "Да", "value": 1},
                {"id": 1062, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 107,
            "text": "Родитель когда-либо бил, избивал, пинал вас или наносил вам физический вред?",
            "answers": [
                {"id": 1071, "text": "Да", "value": 1},
                {"id": 1072, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 108,
            "text": "Вы чувствовали, что никто в вашей семье не любил вас?",
            "answers": [
                {"id": 1081, "text": "Да", "value": 1},
                {"id": 1082, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 109,
            "text": "Были ли у вас нежелательные половые контакты?",
            "answers": [
                {"id": 1091, "text": "Да", "value": 1},
                {"id": 1092, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 110,
            "text": "Считаете ли вы, что вышеперечисленный опыт повлиял на вашу жизнь?",
            "answers": [
                {"id": 1101, "text": "Нет", "value": 0},
                {"id": 1102, "text": "Отчасти", "value": 1},
                {"id": 1103, "text": "Существенно", "value": 2},
            ],
        },
        {
            "id": 111,
            "text": "Сколько вам лет?",
            "answers": [
                {"id": 1111, "text": "14-20", "value": 0},
                {"id": 1112, "text": "21-25", "value": 0},
                {"id": 1113, "text": "26-35", "value": 0},
                {"id": 1114, "text": "35+", "value": 0},
            ],
        },
        {
            "id": 112,
            "text": "Ваш пол",
            "answers": [
                {"id": 1121, "text": "Мужской", "value": 0},
                {"id": 1122, "text": "Женский", "value": 0},
            ],
        },
    ],
}

MOCK_TEST_2 = {
    "id": 2,
    "name": "Токсичные ли у вас родители?",
    "questions": [
        {
            "id": 200,
            "text": "Ваши родители говорили вам, что вы плохой или никчёмный?",
            "answers": [
                {"id": 2001, "text": "Да", "value": 1},
                {"id": 2002, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 201,
            "text": "Ваши родители прибегали к физическим наказаниям во имя дисциплины?",
            "answers": [
                {"id": 2011, "text": "Да", "value": 1},
                {"id": 2012, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 202,
            "text": "Ваши родители пили и/или принимали наркотики?",
            "answers": [
                {"id": 2021, "text": "Да", "value": 1},
                {"id": 2022, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 203,
            "text": "Были ли ваши родители в тяжёлой депрессии или эмоционально недоступными?",
            "answers": [
                {"id": 2031, "text": "Да", "value": 1},
                {"id": 2032, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 204,
            "text": "Вам приходилось заботиться в детстве о ваших родителях?",
            "answers": [
                {"id": 2041, "text": "Да", "value": 1},
                {"id": 2042, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 205,
            "text": "Вам сделали что-то, что должно было храниться в тайне?",
            "answers": [
                {"id": 2051, "text": "Да", "value": 1},
                {"id": 2052, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 206,
            "text": "Вы боялись ваших родителей большую часть времени?",
            "answers": [
                {"id": 2061, "text": "Да", "value": 1},
                {"id": 2062, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 207,
            "text": "Когда вы злились на ваших родителей, вам было страшно, что они это заметят?",
            "answers": [
                {"id": 2071, "text": "Да", "value": 1},
                {"id": 2072, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 208,
            "text": "Думаете ли вы, что вы состоите в деструктивных/абьюзивных отношениях?",
            "answers": [
                {"id": 2081, "text": "Да", "value": 1},
                {"id": 2082, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 209,
            "text": "Думаете ли вы, что эмоционально близкий причинит вам страдание или бросит?",
            "answers": [
                {"id": 2091, "text": "Да", "value": 1},
                {"id": 2092, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 210,
            "text": "Вы ждёте от людей худшего? И в целом от жизни?",
            "answers": [
                {"id": 2101, "text": "Да", "value": 1},
                {"id": 2102, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 211,
            "text": "Вам трудно определить, кто вы, что чувствуете и чего хотите?",
            "answers": [
                {"id": 2111, "text": "Да", "value": 1},
                {"id": 2112, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 212,
            "text": "Вы боитесь, что если люди узнают вас как вы есть, они перестанут любить вас?",
            "answers": [
                {"id": 2121, "text": "Да", "value": 1},
                {"id": 2122, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 213,
            "text": "Если вы добиваетесь успеха, чувствуете ли вы тревогу?",
            "answers": [
                {"id": 2131, "text": "Да", "value": 1},
                {"id": 2132, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 214,
            "text": "Вы обижаетесь или вам становится грустно без видимой причины?",
            "answers": [
                {"id": 2141, "text": "Да", "value": 1},
                {"id": 2142, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 215,
            "text": "Вы перфекционист(ка)?",
            "answers": [
                {"id": 2151, "text": "Да", "value": 1},
                {"id": 2152, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 216,
            "text": "Вам трудно расслабиться или развлечься?",
            "answers": [
                {"id": 2161, "text": "Да", "value": 1},
                {"id": 2162, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 217,
            "text": "Несмотря на ваши старания, видите ли вы сами себя «копией родителей»?",
            "answers": [
                {"id": 2171, "text": "Да", "value": 1},
                {"id": 2172, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 218,
            "text": "Ваши родители продолжают обращаться с вами, как с ребёнком?",
            "answers": [
                {"id": 2181, "text": "Да", "value": 1},
                {"id": 2182, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 219,
            "text": "Вы принимаете важные решения, базируясь на мнении ваших родителей?",
            "answers": [
                {"id": 2191, "text": "Да", "value": 1},
                {"id": 2192, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 220,
            "text": "Когда вы встречаетесь с родителями, возникают ли у вас эмоциональные реакции?",
            "answers": [
                {"id": 2201, "text": "Да", "value": 1},
                {"id": 2202, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 221,
            "text": "Вам страшно поссориться с вашими родителями?",
            "answers": [
                {"id": 2211, "text": "Да", "value": 1},
                {"id": 2212, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 222,
            "text": "Ваши родители манипулируют вами с помощью угроз или обвинений?",
            "answers": [
                {"id": 2221, "text": "Да", "value": 1},
                {"id": 2222, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 223,
            "text": "Ваши родители манипулируют вами с помощью денег?",
            "answers": [
                {"id": 2231, "text": "Да", "value": 1},
                {"id": 2232, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 224,
            "text": "Вы считаете, что ответственны за то, как чувствуют себя ваши родители?",
            "answers": [
                {"id": 2241, "text": "Да", "value": 1},
                {"id": 2242, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 225,
            "text": "Кажется ли вам, что то, что вы делаете для родителей, всегда недостаточно?",
            "answers": [
                {"id": 2251, "text": "Да", "value": 1},
                {"id": 2252, "text": "Нет", "value": 0},
            ],
        },
        {
            "id": 226,
            "text": "Думаете ли вы, что когда-то, неизвестно как, но ваши родители станут лучше?",
            "answers": [
                {"id": 2261, "text": "Да", "value": 1},
                {"id": 2262, "text": "Нет", "value": 0},
            ],
        },
    ],
}


MOCK_TESTS = [MOCK_TEST_1, MOCK_TEST_2]
