MOCK_TEST_1 = {
    "name": "Тест о наличии НДО",
    "questions": [
        {
            "text": "Вы ощущали нехватку еды или были вынуждены носить грязную одежду?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы потеряли родителя вследствие развода, смерти или по другой причине?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы проживали с кем-то, кто был в депрессии или психически болен",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы проживали с кем-то, у кого были проблемы с выпивкой или наркотиками?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители когда-либо избивали или угрожали причинить вред друг другу?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы проживали с кем-то, кто попал в тюрьму?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Родитель когда-либо обзывал, оскорблял или подавлял вас?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Родитель когда-либо бил, избивал, пинал вас или наносил вам физический вред?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы чувствовали, что никто в вашей семье не любил вас?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Были ли у вас нежелательные половые контакты?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Считаете ли вы, что вышеперечисленный опыт повлиял на вашу жизнь?",
            "answers": [
                {"text": "Нет", "value": 0},
                {"text": "Отчасти", "value": 1},
                {"text": "Существенно", "value": 2},
            ],
        },
        {
            "text": "Сколько вам лет?",
            "answers": [
                {"text": "14-20", "value": 0},
                {"text": "21-25", "value": 0},
                {"text": "26-35", "value": 0},
                {"text": "35+", "value": 0},
            ],
        },
        {
            "text": "Ваш пол",
            "answers": [
                {"text": "Мужской", "value": 0},
                {"text": "Женский", "value": 0},
            ],
        },
    ],
}

MOCK_TEST_2 = {
    "name": "Токсичные ли у вас родители?",
    "questions": [
        {
            "text": "Ваши родители говорили вам, что вы плохой или никчёмный?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители прибегали к физическим наказаниям во имя дисциплины?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители пили и/или принимали наркотики?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Были ли ваши родители в тяжёлой депрессии или эмоционально недоступными?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вам приходилось заботиться в детстве о ваших родителях?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вам сделали что-то, что должно было храниться в тайне?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы боялись ваших родителей большую часть времени?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Когда вы злились на ваших родителей, вам было страшно, что они это заметят?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Думаете ли вы, что вы состоите в деструктивных/абьюзивных отношениях?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Думаете ли вы, что эмоционально близкий причинит вам страдание или бросит?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы ждёте от людей худшего? И в целом от жизни?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вам трудно определить, кто вы, что чувствуете и чего хотите?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы боитесь, что если люди узнают вас как вы есть, они перестанут любить вас?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Если вы добиваетесь успеха, чувствуете ли вы тревогу?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы обижаетесь или вам становится грустно без видимой причины?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы перфекционист(ка)?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вам трудно расслабиться или развлечься?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Несмотря на ваши старания, видите ли вы сами себя «копией родителей»?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители продолжают обращаться с вами, как с ребёнком?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы принимаете важные решения, базируясь на мнении ваших родителей?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Когда вы встречаетесь с родителями, возникают ли у вас эмоциональные реакции?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вам страшно поссориться с вашими родителями?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители манипулируют вами с помощью угроз или обвинений?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Ваши родители манипулируют вами с помощью денег?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Вы считаете, что ответственны за то, как чувствуют себя ваши родители?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Кажется ли вам, что то, что вы делаете для родителей, всегда недостаточно?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
        {
            "text": "Думаете ли вы, что когда-то, неизвестно как, но ваши родители станут лучше?",
            "answers": [
                {"text": "Да", "value": 1},
                {"text": "Нет", "value": 0},
            ],
        },
    ],
}


MOCK_TESTS = [MOCK_TEST_1, MOCK_TEST_2]
